# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'owenvoke/casks', 'https://github.com/owenvoke/homebrew-casks.git'
tap 'fwartner/mac-cleanup', 'https://github.com/fwartner/mac-cleanup.git'

##
# Binaries
##
brew 'mas'
brew 'bat'
brew 'bash'
brew 'starship'
brew 'coreutils'
brew 'grep'
brew 'gnu-sed'
brew 'nmap'
brew 'wget'
brew 'gnupg'
brew 'gnupg2'
brew 'gpgme'
brew 'pkg-config'
brew 'ffmpeg'
brew 'imagemagick'
brew 'htop'
brew 'libdvdcss'
brew 'tree'
brew 'mac-cleanup'

##
# Development
##
brew 'git'
brew 'php@7.4', link: true
brew 'php@8.0', link: false
brew 'composer'
brew 'deployer'
brew 'node@12'
brew 'yarn'
cask 'font-fira-code'
cask 'docker'
cask 'phpstorm'
cask 'sublime-text'
cask 'sequel-pro'
cask 'insomnia'
cask 'tinkerwell'
cask 'dbngin'
cask 'owenvoke/casks/helo'

##
# Apps
##
cask 'discord'
cask 'google-backup-and-sync'
cask 'google-drive-file-stream'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'tor-browser'
cask 'spotmenu'
cask 'rectangle'
cask 'imageoptim'
cask 'adobe-creative-cloud'
cask 'handbrake'
cask 'teamviewer'
cask 'adoptopenjdk'
cask 'tinymediamanager'
cask 'sensiblesidebuttons'
cask 'alfred'
cask 'fontbase'
cask 'glyphfinder'
cask 'rocket'

##
# Games
##
cask 'steam'
cask 'battle-net'
cask 'guild-wars2'
cask 'league-of-legends'

##
# Mac App Store
##
mas 'Telegram', id: 747648890
mas 'FB Messenger', id: 1480068668
mas 'Slack', id: 803453959
mas 'Amphetamine', id: 937984704
mas 'FileBot', id: 905384638
mas 'WhatsApp', id: 1147396723
mas 'Bear', id: 1091189122
mas 'Dato', id: 1470584107
mas 'Lieferungen', id: 924726344
mas 'Monit', id: 1014850245
mas 'WeTransfer', id: 1114922065
mas 'Speedtest', id: 1153157709
mas 'iStat Mini', id: 927292435
mas 'MS Word', id: 462054704
mas 'MS Excel', id: 462058435
mas 'Unarchiver', id: 425424353
mas 'ColorSlurp', id: 1287239339
mas 'AudioBookBinder', id: 413969927
mas '1Password', id: 443987910
